{
  "main": {
    "name":"Jackie Pederson",
    "description":"Full-stack web developer and innovative problem-solver who is passionate about developing apps and continuous learning of new technologies. Strengths in communication, collaboration, and building projects from ideation to execution. Please feel free to look around this portfolio site and reach out",
    "image":"profilePicture.png",
    "bio":"With my engineering degree and software development experience, I enjoy solving problems with innovative solutions in technology. While I have refined my soft-skills through working collaboratively at my current job, I have recently acquired technical skills through the completition of the Coding Boot Camp through University of Texas - Austin. I have enjoyed learning software development techniques, and I am looking forward to applying them in a more direct way as I begin my career in the tech industry.",
    "contactmessage":"You can connect with me through these ways;",
    "email": "jackie.pederson2015@gmail.com",
    "phone": "832-483-2609",
    "github":"https://github.com/JackieHodges",
    "project":"https://github.com/JackieHodges/React-Portfolio",
    "address":{
      "city":"Houston",
      "state":"Texas",
      "zip": "77043"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"PedersonResume.pdf",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/jackiehodgespederson/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/JackieHodges",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Below are some of my skills I have acquired:",
    "education":[
      {
        "school":"Texas A&M University - College Station",
        "degree":"BS in Biological & Agricultural Engineering",
        "graduated":"December 2015",
        "description":"Describe your experience at school, what you learned, what useful skills you have acquired etc."
      },
      {
        "school":"University of Texas - Austin",
        "degree":"Coding Boot Camp",
        "graduated":"June 2021",
        "description":"Describe your experience at school, what you learned, what useful skills you have acquired etc."
      }
    ],
    "work":[
      {
        "company":"Olea Edge Analytics",
        "title":"Software Developer",
        "years":"May 2022 - March 2023",
        "description": [
          "Developed and implemented features and reusable components such as a sharing modal, drag and drop functionality, responsive layouts, feature flagging, etc.",
          "Assisted in trouble shooting, resolving issues, and writing unit tests.", 
          "Provided feedback in code reviews while also fostering an environment of open communication and continued education with other team members.",
          "Collaborated with cross functional teams such as back-end team members, customer experience leads, and product managers to define deliverables and associated timeline estimations.",
          "Participated in sprint planning, task decomposition, and daily stand ups to ensure deliverables were being met."
        ]
      },
      {
        "company":"Trinity Operating - Subsidiary of NextEra Energy",
        "title":"Environmental Specialist",
        "years":"January 2016 - May 2022",
        "description":[
          "Managed environmental due diligence associated with over 2,000 upstream wells prior to acquisition.",
          "Coordinated remediation efforts to ensure that environmental releases were delineated, remediated, and closed out with the necessary governmental entities within specified time frames and budgets ranging from $10,000 to $5MM.",
          "Assisted in building out software solution -- Maximo and OneEx -- to assist with tracking and closing out of submitted work orders.", 
          "Coordinated with various internal business units to advise about environmental risks associated with various stages of projects."
        ]
      }
    ],
    "skills":[
      {
        "name":"React",
        "level":"100%"
      },
      {
        "name":"JavaScript",
        "level":"100%"
      },
            {
        "name":"TypeScript",
        "level":"100%"
      },
      {
        "name":"Jira",
        "level":"100%"
      },
      {
        "name":"Git",
        "level":"100%"
      },
      {
        "name":"GitLab/GitHub",
        "level":"100%"
      },
      {
        "name":"HTML/CSS",
        "level":"100%"
      },
      {
        "name":"Tailwind",
        "level":"100%"
      },
      {
        "name":"Bootstrap",
        "level":"100%"
      },
      {
        "name":"Figma",
        "level":"100%"
      },
      {
        "name":"Auth0",
        "level":"100%"
      },
      {
        "name":"Node.js",
        "level":"100%"
      },
      {
        "name":"Express",
        "level":"100%"
      },
      {
        "name":"mySQL & Sequelize",
        "level":"100%"
      },
      {
        "name":"No SQL, MongoDB, & Mongoose",
        "level":"100%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Where's The Party At?",
        "description":"Where's The Party At (WTPA) is an application that assists in trip planning for groups. It allows users to create, invite, and consolidate conversations and polling to a single app.",
        "image":"wtpa.png",
        "deployed":"https://wtpa.herokuapp.com/",
        "project_github": "https://github.com/JackieHodges/WTPA"
      },
      {
        "title":"WeekDaze",
        "description":"WeekDaze is an application that tracks a users job search status. It allows for the user to have a log in, add new job leads, add milestones per each lead, and view a graphic of the amount of days its been since they have applied to a job.",
        "image":"jobDashboard.png",
        "deployed":"https://arcane-harbor-21800.herokuapp.com/",
        "project_github": "https://github.com/JackieHodges/WeekDaze"
      },
      {
        "title":"WeatherTunes",
        "description":"WeatherTunes is an application that curates a music playlist based on the user entered city current weather condition.",
        "image":"weathertunes.png",
        "deployed":"https://jackiehodges.github.io/WeatherTunes/",
        "project_github": "https://github.com/JackieHodges/WeatherTunes"
      }
    ]
  }
}
